{
    "id":  16,
    "title":  "Sticker Pack",
    "description":  "Designing tarot and astrology sticker packs demands different skills that grand story illustration, focusing on simplicity, recognizability, and digital optimization.",
    "imageUrl":  "card-hero.jpg",
    "medium":  "art",
    "genre":  [
                  "Digital Art",
                  "Sticker Design",
                  "Tarot Art",
                  "Astrology Art",
                  "Commercial Art"
              ],
    "style":  [
                  "Simple",
                  "Recognizable",
                  "Digital-Optimized",
                  "Clean",
                  "Versatile"
              ],
    "tech":  [
                 "Digital Illustration",
                 "Vector Art",
                 "Sticker Design",
                 "Digital Optimization",
                 "Commercial Art"
             ],
    "mood":  "Playful",
    "year":  2024,
    "role":  "Digital Artist, Sticker Designer, Commercial Artist",
    "variant":  "wide",
    "status":  "ongoing",
    "links":  {
                  "shop":  "#",
                  "portfolio":  "#"
              },
    "pitch":  "Clean, recognizable sticker designs that bring tarot and astrology into everyday digital communication with style and simplicity.",
    "challenge":  "Creating designs that are both simple enough for small-scale digital use and rich enough to convey the depth of tarot and astrology symbolism.",
    "development":  "Developed a design system that balances simplicity with symbolic richness, optimized for digital platforms and small-scale applications.",
    "outcome":  "A collection of versatile sticker designs that make tarot and astrology accessible and stylish for digital communication.",
    "process":  "<h3>The Sticker Design Process</h3><p>The creation of these sticker designs involved developing a unique approach to simplifying complex spiritual symbols while maintaining their essential meaning and visual appeal. Each design was carefully crafted for digital communication.</p><h4>1. Symbol Research</h4><p>We began by deeply studying the original tarot and astrology symbols, understanding their core meanings and visual elements that make them recognizable and powerful.</p><h4>2. Simplification Process</h4><p>Next, we developed techniques for reducing complex symbols to their essential elements, ensuring they remain meaningful while being simple enough for small-scale digital use.</p><h4>3. Digital Optimization</h4><p>Each design was optimized for digital platforms, considering factors like small size, various backgrounds, and the need for instant recognition.</p>",
    "inspiration":  "<h3>Bringing Spirituality to Digital Communication</h3><p>Inspired by the desire to bring the wisdom and beauty of tarot and astrology into everyday digital communication. We wanted to create designs that could make spiritual concepts accessible and stylish for modern digital interactions.</p><p>We drew from successful sticker design trends, digital art principles, and the universal appeal of spiritual symbols to create designs that resonate with contemporary audiences while honoring traditional meanings.</p>",
    "gallery":  [
                    {
                        "url":  "sticker-pack-overview.jpg",
                        "title":  "Sticker Pack Overview",
                        "description":  "Complete collection of tarot and astrology stickers",
                        "hotspots": [
                            {
                                "x": 50, "y": 40,
                                "title": "Complete Collection",
                                "description": "The full range of tarot and astrology stickers designed for digital communication."
                            },
                            {
                                "x": 75, "y": 60,
                                "title": "Design Consistency",
                                "description": "Consistent visual style that unifies the entire collection while maintaining individual character."
                            }
                        ]
                    },
                    {
                        "url":  "sticker-pack-tarot-stickers.jpg",
                        "title":  "Tarot Stickers",
                        "description":  "Major arcana designs simplified for sticker format",
                        "hotspots": [
                            {
                                "x": 40, "y": 50,
                                "title": "Symbol Simplification",
                                "description": "Complex tarot symbols reduced to their essential elements while maintaining meaning."
                            },
                            {
                                "x": 70, "y": 35,
                                "title": "Digital Readability",
                                "description": "Designs optimized for small-scale digital use and instant recognition."
                            }
                        ]
                    },
                    {
                        "url":  "sticker-pack-astrology-stickers.jpg",
                        "title":  "Astrology Stickers",
                        "description":  "Zodiac signs and astrological symbols",
                        "hotspots": [
                            {
                                "x": 35, "y": 45,
                                "title": "Zodiac Collection",
                                "description": "All twelve zodiac signs designed with consistent style and clear symbolism."
                            },
                            {
                                "x": 65, "y": 55,
                                "title": "Astrological Elements",
                                "description": "Additional astrological symbols that complement the zodiac collection."
                            }
                        ]
                    },
                    {
                        "url":  "sticker-pack-digital-applications.jpg",
                        "title":  "Digital Applications",
                        "description":  "Stickers in use on various digital platforms",
                        "hotspots": [
                            {
                                "x": 45, "y": 40,
                                "title": "Platform Integration",
                                "description": "Stickers seamlessly integrated into various digital communication platforms."
                            },
                            {
                                "x": 80, "y": 70,
                                "title": "Usage Examples",
                                "description": "Real-world examples of how the stickers enhance digital conversations."
                            }
                        ]
                    }
                ],
    "journey":  [
                    {
                        "title":  "Design Research",
                        "description":  "Studied successful sticker designs and digital art trends"
                    },
                    {
                        "title":  "Symbol Simplification",
                        "description":  "Developed techniques for simplifying complex tarot and astrology symbols"
                    },
                    {
                        "title":  "Digital Optimization",
                        "description":  "Created designs optimized for small-scale digital use"
                    },
                    {
                        "title":  "Style Development",
                        "description":  "Established consistent visual style across all sticker designs"
                    },
                    {
                        "title":  "Collection Curation",
                        "description":  "Curated cohesive collections for different themes and uses"
                    }
                ],
    "specs":  [
                  {
                      "title":  "Design System",
                      "description":  "Consistent visual style optimized for digital sticker use"
                  },
                  {
                      "title":  "Symbol Simplification",
                      "description":  "Techniques for reducing complex symbols to simple, recognizable forms"
                  },
                  {
                      "title":  "Digital Optimization",
                      "description":  "Designs optimized for small-scale digital applications"
                  },
                  {
                      "title":  "Color Palette",
                      "description":  "Carefully chosen colors that work well in digital environments"
                  },
                  {
                      "title":  "Scalability",
                      "description":  "Vector-based designs that maintain quality at various sizes"
                  },
                  {
                      "title":  "Commercial Application",
                      "description":  "Designs suitable for commercial use across digital platforms"
                  }
              ]
}
