{
  "id": 2,
  "title": "Papi Chispa - Cartas del Deseo",
  "description": "An interactive AI-powered tarot experience that merges ancient symbolism with modern generative language models — offering nuanced, personal readings through a mystical, meditative UI.",
  "imageUrl": "./images/uploads/projects/papi-chispa/papi.jpg",
  "medium": "code",
  "genre": ["Web Development", "AI/ML"],
  "style": ["Minimalist", "Mystical", "Meditative"],
  "tech": ["JavaScript", "HTML5", "CSS Grid", "Gemini API"],
  "mood": "Mystical",
  "year": 2025,
  "role": "Lead Developer & UX Designer",
  "variant": "wide",
  "status": "development",
  "links": {
    "demo": "https://papi-chispa.demo.rs@RSwan.org"
  },
  "pitch": "Papi Chispa reimagines the age-old practice of tarot divination for the digital age — a mystical web application that speaks like a real tarot reader, thanks to the power of generative AI. Rather than generic fortune-cookie results, Papi delivers context-aware, insightful readings in a clean, calming interface. It bridges old-world symbolism and cutting-edge technology to create a truly personal, immersive experience.",
  "challenge": "- Designing prompts and system messages to encourage creative, human-like interpretations of cards while staying contextually accurate.\n- Ensuring users feel each reading is specific to them — not a prewritten blurb.\n- Creating an interface that complements the spiritual tone while remaining accessible and responsive across devices.\n- Balancing simplicity in UX with the rich symbolism of tarot.",
  "development": "- Crafted a fine-tuned prompt and memory architecture for the Gemini API that understands the interplay between tarot cards.\n- Developed a minimalist front-end with vanilla JS, HTML5, and CSS Grid to keep the app light yet responsive.\n- Designed a meditative UI theme, employing calming colors and accessible contrast while embracing mystical motifs.\n- Optimized UX for mobile and desktop alike, including ARIA support for screen readers and WCAG compliance.\n- User tested with both tarot enthusiasts and first-time users to refine tone and flow.",
  "outcome": "- Avg. session time: 5+ minutes — a clear sign of user engagement.\n- Users praised the depth and authenticity of AI-generated readings.\n- Positive feedback highlighted the intuitive, calming UI and its harmony with the spiritual theme.\n- Sparked conversations about integrating AI into other spiritual and creative tools.",
  "gallery": [
    {
      "url": "./images/uploads/projects/papi-chispa/papi.jpg",
      "title": "Main Interface",
      "description": "The mystical tarot reading interface with AI-powered interpretations",
      "dimensions": "1200x800"
    }
  ]
} 