{
    "id":  100,
    "title":  "Arcana",
    "description":  "Major arcana archetypes as characters in a story as grand as the universe, exploring the timeless wisdom and cosmic drama of the tarot through narrative.",
    "imageUrl":  "card-hero.jpg",
    "medium":  "writing",
    "genre":  [
                  "Fantasy",
                  "Archetypal Fiction",
                  "Cosmic Drama",
                  "Philosophical Fiction",
                  "Tarot-Inspired"
              ],
    "style":  [
                  "Epic",
                  "Archetypal",
                  "Cosmic",
                  "Philosophical",
                  "Mythological"
              ],
    "tech":  [
                 "Creative Writing",
                 "Archetypal Analysis",
                 "Tarot Study",
                 "World Building",
                 "Character Development"
             ],
    "mood":  "Mystical",
    "year":  2024,
    "role":  "Author, World Builder, Archetypal Researcher",
    "variant":  "featured",
    "status":  "in-progress",
    "pitch":  "A cosmic drama where the major arcana come to life as characters in a story that spans the universe, exploring timeless wisdom through epic narrative.",
    "challenge":  "Balancing the cosmic scale of the story with intimate character moments, ensuring each arcana character feels both archetypal and uniquely individual while maintaining narrative coherence.",
    "development":  "Extensive research into tarot symbolism and archetypal psychology. Deep world-building that connects cosmic forces with personal transformation.",
    "outcome":  "A grand narrative that brings the wisdom of the tarot to life through compelling characters and cosmic drama.",
    "excerpts":  "<p>The cobblestones of Arcana buzzed with a symphony of life—each merchant's call, each child's laugh, each hoofbeat against the sun-baked stone a note in the city's vibrant melody. Elias, a wanderer with eyes as green as the Emerald Forest, moved through the throng, the straps of his travel-worn pack cutting into his shoulders. The weight wasn't just in the leather and canvas, but in the secrets he carried, secrets as heavy as the gold coin that hung cold against his warm chest.</p><p>The air thrummed with a strange energy, like a lute string plucked by an unseen hand. Elias's gaze was drawn to a stall overflowing with herbs and potions, their scents mingling with the smoke of incense and the sweet perfume of pastries. Behind the stall stood a figure cloaked in the humble garb of a commoner, yet there was a quiet authority in his stance, a wisdom in his eyes that belied the simple clothes. The man, H, lifted his gaze, his eyes a deep sapphire blue that seemed to pierce Elias's very soul.</p><p>A silent conversation passed between them, a recognition that transcended words. It was as if the universe had orchestrated their meeting, a dance of destiny playing out on the crowded streets of Arcana. A spark of curiosity ignited within Elias, a desire to know the man behind the cloak, the soul behind the eyes.</p><p>Just then, a priestess named Ishtar, her head adorned with a wreath of moonflowers, emerged from the shadows of the temple. Her gaze swept across the marketplace, landing on Elias and H with an almost knowing smile. She nodded subtly, a gesture that seemed to bridge the distance between the two men, an invitation to a deeper connection.</p><p>H, sensing the priestess's silent urging, offered Elias a small vial filled with a shimmering liquid. 'For your journey,' he said, his voice a low rumble that resonated with Elias's core.</p><p>Elias accepted the vial, his fingers brushing against H's, a fleeting touch that sent a jolt of electricity through him. He lifted the vial to his lips, the liquid within tasting of starlight and ancient wisdom. It warmed his blood, filling him with a sense of purpose, a yearning for the secrets that awaited him in the heart of Arcana.</p><p>As Elias turned to leave, he couldn't shake the feeling that this was just the beginning, the first note in a symphony of love and destiny, a melody that would change the course of his life forever. The marketplace swirled around him, a blur of color and sound, but all he could see was the sapphire blue of H's eyes, a beacon that promised adventure, passion, and a love that transcended the boundaries of the ordinary.</p>",
    "themesAnalysis":  "<h3>Central Themes</h3><p>The story explores themes of universal wisdom, personal transformation, the interconnectedness of all things, and the power of archetypal forces in shaping human experience.</p><h4>Archetypal Wisdom</h4><p>Each major arcana character embodies universal archetypes that resonate across cultures and time periods, representing fundamental aspects of human experience and consciousness.</p><h4>Cosmic Interconnectedness</h4><p>The narrative explores how individual choices and transformations ripple through the cosmic fabric, affecting the balance of universal forces.</p>",
    "process":  "I being by definining the characters and the world they inhabit. I then started to build out the world and the characters. I then started to write the story, and as I wrote I would refine the characters and the world. I would then write more, and refine the characters and the world again. I would repeat this process until I was happy with the story and the characters and the world.",
    "inspiration":  "My inspiration for this project was the idea of the major arcana as characters in a story as grand as the universe, exploring the timeless wisdom and cosmic drama of the tarot through narrative.",
    "gallery":  [
                    {
                        "url":  "arcana-cover-art.jpg",
                        "title":  "Arcana Cover",
                        "description":  "Visual representation of the major arcana as cosmic characters",
                        "dimensions":  "1200x800"
                    },
                    {
                        "url":  "arcana-character-designs.jpg",
                        "title":  "Arcana Characters",
                        "description":  "Character designs for the major arcana archetypes",
                        "dimensions":  "1200x800"
                    },
                    {
                        "url":  "arcana-cosmic-setting.jpg",
                        "title":  "Cosmic Setting",
                        "description":  "The vast universe where the arcana drama unfolds",
                        "dimensions":  "1200x800"
                    }
                ],
    "journey":  [
                    {
                        "title":  "Tarot Research",
                        "description":  "<div style='display: flex; gap: 2rem; align-items: start; margin: 2rem 0;'><div style='flex: 0 0 40%;'><img src='images/projects/arcana/tarot-research.png' alt='Character sketch' style='width: 100%; border-radius: 1px;'></div><div style='flex: 1;'>I immersed myself in the world of the Tarot archetypes: <em>somewhat aimless at first.</em></div></div>"
                    },
                    {
                        "title":  "Character Development",
                        "description":  "<div style='display: flex; gap: 2rem; align-items: start; margin: 2rem 0;'><div style='flex: 0 0 40%;'><img src='images/projects/arcana/the-star-festival-of-lights.png' alt='Character sketch' style='width: 100%; border-radius: 1px;'></div><div style='flex: 1;'>But the more time I spent getting to know the cards, and the archetypes, the more I felt a world of characters opening up to me.</div></div>"
                    },
                    {
                        "title":  "World Building",
                        "description": "<div style='display: flex; flex-direction: column; gap: 1.5rem; margin: 2rem 0;'><div style='text-align: center;'><img src='images/projects/arcana/world-building.png' alt='Character sketch' style='width: 100%; max-width: 400px; border-radius: 10px;'></div><div style='text-align: center;'>I started building out characters and with them the world they inhabitted. The world of Arcana is a place where the major arcana are not just symbols, but characters with their own stories and motivations. Their own place.</div></div>"
                    },{
                        "title":  "Philosophical Integration",
                        "description":  "<div style='display: flex; gap: 2rem; align-items: start; margin: 2rem 0;'><div style='flex: 0 0 40%;'><img src='images/projects/arcana/philosophical-themes.jpg' alt='Character sketch' style='width: 100%; border-radius: 1px;'></div><div style='flex: 1;'>Wove timeless wisdom and philosophical themes throughout the narrative</div></div>"
                    }
                ],
    "specs":  [
                  {
                      "title":  "Genre",
                      "description":  "Epic fantasy with strong archetypal and philosophical elements"
                  },
                  {
                      "title":  "Character System",
                      "description":  "22 major arcana characters, each representing universal archetypes and wisdom"
                  },
                  {
                      "title":  "World Setting",
                      "description":  "Cosmic universe that reflects the universal nature of tarot symbolism"
                  },
                  {
                      "title":  "Thematic Elements",
                      "description":  "Transformation, wisdom, cosmic forces, personal growth, and universal truths"
                  },
                  {
                      "title":  "Narrative Approach",
                      "description":  "Epic storytelling that balances cosmic scale with intimate character development"
                  },
                  {
                      "title":  "Philosophical Depth",
                      "description":  "Integration of timeless wisdom and archetypal psychology throughout the story"
                  }
              ]
}
